Revit 2027 API
FailureHandlingOptions.GetDelayedMiniWarnings Method
 Obtains the flag indicating if showing of mini-warning dialog should be delayed until the end of next transaction.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool GetDelayedMiniWarnings()
Public Function GetDelayedMiniWarnings As Boolean
public:
bool GetDelayedMiniWarnings()
member GetDelayedMiniWarnings : unit -> bool
Return Value
Boolean
 True to delay the display of the mini-warning dialog until the end of the next transation, false to display them as this transaction is completed.
See Also
Reference
FailureHandlingOptions Class
Autodesk.Revit.DB Namespace